---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.AlignmentFailures
source: html/d6f3982f-0126-8066-44c5-ea21ba7c8b77.htm
---
# BuiltInFailures.AlignmentFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.